[{"term":"algorithm","definition":"An automated, pre-programmed set of rules that can be used to execute an electronic trade.","slug":"algorithm"},{"term":"clearing","definition":"The procedure through which a clearing house becomes the buyer to each seller of a futures contract and the seller to each buyer, and assumes the responsibility of ensuring that each buyer and seller performs on each contract.","slug":"clearing"},{"term":"clearing firm","definition":"A company that works directly through an exchange's clearing house to execute trades on behalf of futures market participants.","slug":"clearing-firm"},{"term":"clearing house","definition":"The division of a futures exchange that confirms, clears and settles all trades through an exchange.","slug":"clearing-house"},{"term":"commodity","definition":"Any product approved and designated for trading or clearing in accordance with the rules of an exchange. Also may refer to a physical commodity.","slug":"commodity"},{"term":"Commodity Futures Trading Commission (CFTC)","definition":"Also known as the CFTC, this is the independent governmental organization that oversees futures and options trading in the United States.","slug":"commodity-futures-trading-commission-(cftc)"},{"term":"contract","definition":"A formal and legally binding agreement between two or more parties.","slug":"contract"},{"term":"counterparty","definition":"The individual or company (i.e., the buyer or seller) on the opposite side of any trade.","slug":"counterparty"},{"term":"delivery","definition":"The changing of ownership or control of a commodity once a futures contract date expires.","slug":"delivery"},{"term":"derivative","definition":"A financial instrument, such as a futures or options contract, whose value is based upon a physical commodity or other financial instruments.","slug":"derivative"},{"term":"electronic trading","definition":"The computerized processes and platforms that carry out a trade, including order placement, bid-and-offer posting and trade execution.","slug":"electronic-trading"},{"term":"equity index","definition":"A measure of a group of stocks, also called equities, used to describe the market and analyze the return on specific stock investment.","slug":"equity-index"},{"term":"exchange","definition":"A central marketplace with established rules and regulations where buyers and sellers meet to trade futures and options contracts.","slug":"exchange"},{"term":"execution","definition":"The completion of an order to buy or sell a futures contract.","slug":"execution"},{"term":"financial future","definition":"A future contract whose value is based upon financial instruments such as a stock index, interest rates or foreign currency exchange rates.","slug":"financial-future"},{"term":"financial instrument","definition":"A commodity based in financial instruments such as a stock index, interest rates or foreign currency exchange rates.","slug":"financial-instrument"},{"term":"foreign exchange rate","definition":"The price of a country's currency when converted from another country's currency.","slug":"foreign-exchange-rate"},{"term":"fundamental analysis","definition":"Examining the underlying forces that affect the well-being of the economy, industry groups and companies, while also considering intrinsic value.","slug":"fundamental-analysis"},{"term":"future","definition":"A standardized contract for the purchase and sale of financial instruments or physical commodities on a futures exchange for future delivery.","slug":"future"},{"term":"futures exchange","definition":"A central marketplace where buyers and sellers come together to trade futures and options contracts.","slug":"futures-exchange"},{"term":"hedge","definition":"To buy or sell a futures contract in order to lock in the price of the underlying commodity at a later date.","slug":"hedge"},{"term":"institutional trader","definition":"A person or entity employed to trade on behalf of entities, including institutions, investment banks, pension funds, hedge funds and mutual funds.","slug":"institutional-trader"},{"term":"leverage","definition":"To increase the potential return on an investment through the use of futures contracts (or other financial instruments).","slug":"leverage"},{"term":"limit order","definition":"An order that allows the buyer to define the maximum price to pay and the seller the minimum price to accept. It remains on the book until the order is either executed, canceled or expired.","slug":"limit-order"},{"term":"liquidity","definition":"The ability to buy or sell orders of any size quickly and efficiently without a substantial impact on market price.","slug":"liquidity"},{"term":"macroeconomics","definition":"The field of economics focused on movements and trends in the economy as a whole. Its central concepts include the laws of supply and demand.","slug":"macroeconomics"},{"term":"market abuse","definition":"Circumstances where an individual or entity breaks the rules of the exchange and\/or the CFTC, putting market participants at a disadvantage.","slug":"market-abuse"},{"term":"market order","definition":"An order placed at any time during the trading session to immediately execute the entire order at the best available offer price (for buy orders) or bid price (for sell orders).","slug":"market-order"},{"term":"market participant","definition":"Any person, entity or organization who hedges and\/or speculates through a futures exchange.","slug":"market-participant"},{"term":"microeconomics","definition":"The field of economics focused on individual factors and the impact they have on interactions between single buyers and sellers. Its central concepts include the laws of supply and demand.","slug":"microeconomics"},{"term":"open outcry","definition":"A method of trading where market participants make bids and offers in person from the trading pits of futures exchanges.","slug":"open-outcry"},{"term":"option","definition":"A contract that gives the bearer the right, but not the obligation, to buy or sell a futures contract at a specified price within a specified time period.","slug":"option"},{"term":"over-the-counter derivative","definition":"Futures and options contracts with terms that do not necessarily adhere to those of a standardized futures contract.","slug":"over-the-counter-derivative"},{"term":"over-the-counter trading","definition":"Trades that take place outside of a formal futures exchange.","slug":"over-the-counter-trading"},{"term":"physical commodity","definition":"A tangible commodity – such as corn, oil, gold or beef – upon which futures prices are set.","slug":"physical-commodity"},{"term":"price discovery","definition":"The process of determining the price for a commodity or financial instrument based on the supply and demand for it in the underlying market.","slug":"price-discovery"},{"term":"risk","definition":"The possibility of losing some or all profits or investment return due to external market factors.","slug":"risk"},{"term":"risk management","definition":"Identifying, analyzing and either mitigating or absorbing the price risk in investing or business planning.","slug":"risk-management"},{"term":"self-regulatory organization (SRO)","definition":"Futures exchanges and regulatory entities that set rules and regulations and have internal functions that perform complex checks and balances to adhere to the principles they set.","slug":"self-regulatory-organization-(sro)"},{"term":"settlement","definition":"The delivery of cash or commodities in exchange for payment, as specified by the terms of the underlying contract.","slug":"settlement"},{"term":"speculator","definition":"An individual who accepts market risk in an attempt to profit from buying and selling futures and\/or options contracts by correctly anticipating future price movements.","slug":"speculator"},{"term":"stop-limit order","definition":"A stop-limit order combines features of stop orders and limit orders, requiring traders to enter a stop price as well as a limit price.","slug":"stop-limit-order"},{"term":"stop order","definition":"A stop order becomes a market order once the price is met. For example, a “buy stop” is placed above the market and is executed only when the market trades at or above the stop price.","slug":"stop-order"},{"term":"technical analysis","definition":"Using charts and other tools to identify patterns in the hopes of understanding potential future activity in markets. This method uses statistical analysis of past market activity, including pieces like past prices and volume without any focus on intrinsic value.","slug":"technical-analysis"},{"term":"trader","definition":"A member of the exchange who buys and sells futures and options through electronic trading platforms and\/or on the floor of the exchange.","slug":"trader"},{"term":"transparency","definition":"The amount of access a market openly offers about its activities and financial information.","slug":"transparency"},{"term":"volatility","definition":"A measurement of the change in price over a given time period.","slug":"volatility"}]